Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler
The Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler class is the adapter's default Tekla.BIM.DirectManipulation.Adapters.IControlsHandler implementation.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.toolbarManager
The manager of known control groups.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.queue
The updates queue.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler class.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.ControlClicked
Occurs when any control is clicked.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.ControlCursorHover
Occurs when any control is hovered.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.ControlStateChanged
Occurs when the state of any control is changed.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.ControlGotKeyboardFocus
Occurs when the control got keyboard focus.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.ControlLostKeyboardFocus
Occurs when the control lost keyboard focus.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.Display(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Displays or updates the given group of controls on the view.
controlsGroup: The controls to display or update.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.Remove(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Removes the given collection of controls from the view.
controlsGroup: The controls to remove.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.Update(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Updates a single group of controls.
updatedGroup: The group to update, not necessarily a root group.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.UpdateLayout(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Updates the layout on the view.
controlsGroup: The controls to update the layout.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.UpdateControl(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase,Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState)
Updates a single control.
updatedControl: The control to update.
shortState: The Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState to apply on updatedControl as a short lived state.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.UpdateView
Updates the view.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.CreateToolbar(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Creates an Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar which represents the given Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup.
controlsGroup: The Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup to wrap with a new Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar.
Returns: A new Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar instance wrapping the controlsGroup parameter.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.OnToolbarDisposed(System.Object,System.EventArgs)
Called when toolbar is disposed.
sender: The sender.
eventArgs: The System.EventArgs instance containing the event data.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.FindControl(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Finds the control representing the root group of the group parameter.
group: The group to find the representing control for.
Returns: The control representing group; or null if not found.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.Show(Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel)
Shows the specified toolbar.
toolbar: The toolbar.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlsHandler.EnqueueMessageAndUpdateView(Tekla.BIM.Common.Contracts.DataMessage[])
Enqueues the messages and updates the view.
messages: The messages.